slackGPT/issue_misc_error/11 PnrRetrieveAndDisplay Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">cce36ba7-1f33-452b-9c51-303fbe7fd472
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/PADSRQ_10_2_1A
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0FG857CMY0</wsse:SessionId>
            <wsse:SequenceNumber>6</wsse:SequenceNumber>
            <wsse:SecurityToken>3UA5111BN9U891JW8ADD32MXX4</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:PNR_RetrieveAndDisplay xmlns:ns0="http://xml.amadeus.com/PADSRQ_10_2_1A">
            <ns0:reservationInfo>
                <ns0:reservation>
                    <ns0:controlNumber>3WKL5P</ns0:controlNumber>
                </ns0:reservation>
            </ns0:reservationInfo>
            <ns0:dynamicOutputOption>
                <ns0:statusDetails>
                    <ns0:action>ALL</ns0:action>
                </ns0:statusDetails>
            </ns0:dynamicOutputOption>
        </ns0:PNR_RetrieveAndDisplay>
    </soap-env:Body>
</soap-env:Envelope>
